
**＜制作期間＞**

2024/01/29 ~ 2024/02/01 (15~20時間程度）

**＜プログラム開発の目的＞**

１：自作曲の乖離具合（＝自分の作曲している音楽ジャンルに作風スタイルが適合しているかどうか）を客観的に把握する。

２：自作曲を含めた類似曲の楽曲リストをSpotify Playlistに自動更新することで収益性、および業務効率性を向上させる。

３：前作（=Google　Colaboratory(Python)+スプレッドシート）からJupiter Lab(python)での一括実行を可能にするため。



**＜手法選択（＝主成分分析）の理由＞**

１：相対的（＝対象曲を定めてから分析する）ではなく、絶対的（＝自作曲がどこに位置しているか）な位置を客観的に認識するため。

２：ユークリッド距離法よりも主成分分析の方がデータの次元削減という点において元データの欠損度合いを減少させると考えたため。

**＜課題＞**

１：主成分分析を実行した結果、２番目の累積寄与率が50%未満だったため、手法選択が適切ではなかった可能性がある。

２：最終の対象曲から類似性の高い楽曲を選出する際の手法はユークリッド距離法を適用してしまった。すなわち、ベクトルデータをスカラーデータとして処理してしまった可能性がある。
